results/horizontal/8xlg_dbxlg/tsung_test.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="edxucla-sh-8xlg-xlg-102639948.us-west-2.elb.amazonaws.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="60" unit="second">
     <users arrivalrate="4" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="60" unit="second">
     <users arrivalrate="6" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="60" unit="second">
     <users arrivalrate="10" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="7" duration="60" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="8" duration="60" unit="second">
     <users arrivalrate="20" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="9" duration="60" unit="second">
     <users arrivalrate="25" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="10" duration="60" unit="second">
     <users arrivalrate="35" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="11" duration="60" unit="second">
     <users arrivalrate="45" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="12" duration="60" unit="second">
     <users arrivalrate="55" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="new-tutor-session" probability="25" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/signup" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rndstring1"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="course_number"/>
      </setdynvars>

      <repeat name="signInLoop" max_repeat="5">
        <thinktime value="3" random="true"/>
        <request subst="true">
          <http url="/signup" version="1.1" method="POST" contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"/>
        </request>

        <request subst="true">
           <dyn_variable name="dashboard_string" re="&lt;(My Dashboard)>"/>
          <http url="/" version="1.1" method="GET"/>
        </request>

        <until var="dashboard_string" neq=""/>
      </repeat>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/edit_profile" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/add_education" version="1.1" method="POST" contents="education%5Bname%5D=university+of+california+los+angeles&amp;education%5Balias%5D=ucla&amp;commit=Add+education"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/edit_profile" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/edit_education?eid=1" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/update_education" version="1.1" method="POST" contents="course_user%5Bcourse_name%5D=computer+science+%%_course_number%%&amp;course_user%5Bcourse_alias%5D=ge%%_course_number%%&amp;course%5Bdepartment%5D=computer+science&amp;commit=Add+Course"/>
      </request>

      <thinktime value="2" random="true"/>

      <repeat name="checkRequests" max_repeat="10">
        <thinktime value="5" random="true"/>
        <request subst="true">
          <dyn_variable name="request_params" re="&lt;form class=&quot;button-to-form&quot; method=&quot;post&quot; action=&quot;(.*)&quot;>"/>
          <http url="/requests" version="1.1" method="GET"/>
        </request>
        <until var="request_params" neq=""/>
      </repeat>

      <if var="request_params" neq="">
        <request subst="true">
          <http url="/%%_request_params%%" version="1.1" method="POST"/>
        </request>

        <thinktime value="5" random="true"/>
        <request subst="true">
          <dyn_variable name="conversation_link" re="&lt;a href=&quot;(.*)&quot;>Conversation"/>
          <http url="/" version="1.1" method="GET"/>
        </request>

        <if var="conversation_link" neq="">
          <for from="1" to="10" incr="1" var="counter">
            <request subst="true">
              <dyn_variable name="other_user_id" re="id=&quot;message-other-user-id&quot; value=&quot;([0-9]*)&quot;"/>
              <dyn_variable name="last_message_time" re="id=&quot;message-last-time&quot; value=&quot;([0-9]*)&quot;"/>
              <dyn_variable name="last_message_id" re="id=&quot;message-last-id&quot; value=&quot;([0-9]*)&quot;"/>
              <http url="%%_conversation_link%%" version="1.1" method="GET"/>
            </request>

            <setdynvars sourcetype="random_string" length="20">
              <var name="rndmessage"/>
            </setdynvars>

            <request subst="true">
              <http url="/send_message" version="1.1" method="POST" contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"/>
            </request>

            <setdynvars sourcetype="random_number" start="1" end="5">
              <var name="poll_number"/>
            </setdynvars>

            <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
              <thinktime value="2" random="true"/>

              <request subst="true">
                <http url="/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%" version="1.1" method="GET"/>
                </request>
            </for>

          </for>
        </if>
      </if>


      </session>

    <session name="new-student-session" probability="25" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/signup" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rndstring1"/>
      </setdynvars>

      <repeat name="signInLoop" max_repeat="5">
        <thinktime value="3" random="true"/>
        <request subst="true">
          <http url="/signup" version="1.1" method="POST" contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"/>
        </request>

        <request subst="true">
           <dyn_variable name="dashboard_string" re="&lt;(My Dashboard)>"/>
          <http url="/" version="1.1" method="GET"/>
        </request>

        <until var="dashboard_string" neq=""/>
      </repeat>

      <request subst="true">
          <dyn_variable name="my_id" re="href=&quot;/users/([0-9]*)&quot;>Profile"/>
          <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="5" random="true"/>

      <repeat name="find_courses" max_repeat="10">
        <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="course_number"/>
        </setdynvars>

        <request subst="true">
          <dyn_variable name="course_url" re="&lt;li>\s*&lt;a href=&quot;(.*)&quot;>computer science"/>
          <http url="/search?type=Course&amp;input=ge%%_course_number%%" version="1.1" method="GET"/>
        </request>
        <until var="course_url" neq=""/>
      </repeat>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <dyn_variable name="user_id" re="&lt;a href=&quot;/users/([0-9]*)&quot;>"/>
        <http url="%%_course_url%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <if var="user_id" neq="">
        <request subst="true">
          <http url="/users/%%_user_id%%" version="1.1" method="GET"/>
        </request>

        <request subst="true">
          <http url="/request_tutor?user=%%_user_id%%" version="1.1" method="POST"/>
        </request>

        <thinktime value="3" random="true"/>

        <setdynvars sourcetype="random_string" length="20">
          <var name="rndmsg"/>
        </setdynvars>

        <request subst="true">
          <http url="/send_user_request" version="1.1" method="POST" contents="message=%%_rndmsg%%&amp;tutor=%%_user_id%%&amp;student=%%_my_id%%&amp;type=tutor_request&amp;commit=Send+Request"/>
        </request>

        <thinktime value="3" random="true"/>

        <repeat name="checkDash" max_repeat="10">
          <thinktime value="5" random="true"/>
          <request subst="true">
            <dyn_variable name="conversation_link" re="&lt;a href=&quot;(.*)&quot;>Conversation"/>
            <http url="/" version="1.1" method="GET"/>
          </request>
          <until var="conversation_link" neq=""/>
        </repeat>


        <if var="conversation_link" neq="">
          <for from="1" to="10" incr="1" var="counter">
            <request subst="true">
              <dyn_variable name="other_user_id" re="id=&quot;message-other-user-id&quot; value=&quot;([0-9]*)&quot;"/>
              <dyn_variable name="last_message_time" re="id=&quot;message-last-time&quot; value=&quot;([0-9]*)&quot;"/>
              <dyn_variable name="last_message_id" re="id=&quot;message-last-id&quot; value=&quot;([0-9]*)&quot;"/>
              <http url="%%_conversation_link%%" version="1.1" method="GET"/>
            </request>

            <setdynvars sourcetype="random_string" length="20">
              <var name="rndmessage"/>
            </setdynvars>

            <request subst="true">
              <http url="/send_message" version="1.1" method="POST" contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"/>
            </request>

              <setdynvars sourcetype="random_number" start="1" end="5">
                <var name="poll_number"/>
              </setdynvars>

              <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
                <thinktime value="2" random="true"/>

                <request subst="true">
                  <http url="/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%" version="1.1" method="GET"/>
                </request>
              </for>

          </for>
        </if>
      </if>

      </session>

    <session name="returning-user" probability="50" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="current_user_id"/>
      </setdynvars>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="session%5Bemail%5D=user_%%_current_user_id%%%40example.com&amp;session%5Bpassword%5D=password&amp;session%5Bremember_me%5D=0%%&amp;commit=Log+in"/>
      </request>

      <repeat name="checkRequests" max_repeat="10">
        <thinktime value="5" random="true"/>
        <request subst="true">
          <dyn_variable name="request_params" re="&lt;form class=&quot;button-to-form&quot; method=&quot;post&quot; action=&quot;(.*)&quot;>"/>
          <http url="/requests" version="1.1" method="GET"/>
        </request>
        <until var="request_params" neq=""/>
      </repeat>

      <if var="request_params" neq="">
        <request subst="true">
          <http url="/%%_request_params%%" version="1.1" method="POST"/>
        </request>
      </if>

      <thinktime value="5" random="true"/>
      <request subst="true">
        <dyn_variable name="conversation_link" re="&lt;a href=&quot;(.*)&quot;>Conversation"/>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <if var="conversation_link" neq="">
        <for from="1" to="10" incr="1" var="counter">
          <request subst="true">
            <dyn_variable name="other_user_id" re="id=&quot;message-other-user-id&quot; value=&quot;([0-9]*)&quot;"/>
            <dyn_variable name="last_message_time" re="id=&quot;message-last-time&quot; value=&quot;([0-9]*)&quot;"/>
            <dyn_variable name="last_message_id" re="id=&quot;message-last-id&quot; value=&quot;([0-9]*)&quot;"/>
            <http url="%%_conversation_link%%" version="1.1" method="GET"/>
          </request>

          <setdynvars sourcetype="random_string" length="20">
            <var name="rndmessage"/>
          </setdynvars>

          <request subst="true">
            <http url="/send_message" version="1.1" method="POST" contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"/>
          </request>

          <setdynvars sourcetype="random_number" start="1" end="5">
            <var name="poll_number"/>
          </setdynvars>

          <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
            <thinktime value="2" random="true"/>

            <request subst="true">
              <http url="/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%" version="1.1" method="GET"/>
              </request>
          </for>

        </for>
      </if>

      </session>

    <session name="search-user" probability="0" type="ts_http">
    </session>
  </sessions>
</tsung>